Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For example, a format string consisting of "hh yyyy mm" would not produce the expected result because it has a date element in between two time elements.
ja: 例えば、「hh yyyy mm」で構成されるフォーマット文字列は、2つの時間要素の間に日付要素があるため、期待した結果を得ることはできません。

source: For example, a function defined as MyMsgMonitor(wParam, lParam, *) would receive only the first two parameters, and one defined as MyMsgMonitor(*) would receive none of them.
ja: 例えば、MyMsgMonitor(wParam, lParam, *)と定義された関数は最初の2つのパラメータのみを受け取り、MyMsgMonitor(*)と定義された関数は何も受け取らないことになります。

source: For example, a function monitoring WM_LBUTTONDOWN (0x0201) may return an integer to prevent the target window from being notified that a mouse click has occurred.
ja: 例えば、WM_LBUTTONDOWN (0x0201) を監視する関数は、マウスクリックが発生したことをターゲットウィンドウに通知しないように、整数を返すことができる。

source: For example, a function that yields -1 as an Int64 is really yielding 0xFFFFFFFFFFFFFFFF if it is designed to yield a UInt64.
ja: 例えば、Int64として-1を返す関数は、UInt64を返すように設計されている場合、実際には0xFFFFFFFFFFFFを返すことになります。

source: For example, a global variable used by a group of hotkeys may be initialized above (or even below) those hotkeys rather than at the top of the script.
ja: 例えば、ホットキーのグループで使用されるグローバル変数は、スクリプトの先頭ではなく、それらのホットキーの上（または下）で初期化することができます。

source: For example, a hotkey could use a variable press_count to count the number of times it is pressed, and send a different key whenever press_count is a multiple of 3 (every third press).
ja: 例えば、ホットキーは変数press_countを使って押された回数をカウントし、press_countが3の倍数のとき（3回押すごとに）別のキーを送信することができます。

source: For example, a line consisting of just 21*2 or "Some text" wouldn't make any sense.
ja: 例えば、21*2や "Some text"だけで構成された行は、何の意味もなさない。

source: For example, a parameter of type VT_BYREF|VT_BOOL would previously have received a ComObjRef object, and would be assigned a value like pbCancel[] := true or NumPut(-1, ComObjValue(pbCancel), "short").
ja: 例えば、VT_BYREF|VT_BOOL型のパラメータは、以前はComObjRefオブジェクトを受け取り、pbCancel[] := trueまたはNumPut(-1, ComObjValue(pbCancel), "short")という値が割り当てられたはずです。

source: For example, a particular game may accept hotstrings only when they have the SendPlay option.
ja: 例えば、あるゲームでは、SendPlayオプションがあるときだけhotstringsを受け入れることができます。

source: For example, a property might take an array index or key.
ja: 例えば、プロパティは配列のインデックスやキーを取ることができる。

source: For example, a result of -1 from a 32-bit window is seen as 0xFFFFFFFF on any version of AutoHotkey, whereas a result of -1 from a 64-bit window is seen as 0xFFFFFFFF on AutoHotkey 32-bit and -1 on AutoHotkey 64-bit.
ja: 例えば、32ビットウィンドウからの-1の結果は、どのバージョンのAutoHotkeyでも0xFFFFFFとして表示されますが、64ビットウィンドウからの-1の結果は、AutoHotkey 32ビットでは0xFFFFFF、AutoHotkey 64ビットでは-1として表示されます。

source: For example, a script can display context-sensitive help via ToolTip whenever the user moves the mouse over particular controls in the window.
ja: 例えば、ユーザーがウィンドウ内の特定のコントロールにマウスを移動すると、スクリプトはToolTipを介してコンテキストセンシティブヘルプを表示することができます。

source: For example, a script containing a::b actually contains the following two hotkeys instead:
ja: 例えば、a::bを含むスクリプトは、実際には代わりに以下の2つのホットキーを含む：

source: For example, a script containing the following lines would expand ceo, cfo, and btw wherever you type them:
ja: 例えば、以下の行を含むスクリプトは、ceo、cfo、btwをどこに入力しても展開します：

source: For example, a script could have its own custom WinExist function that is called instead of the standard one.
ja: 例えば、スクリプトに独自のカスタムWinExist関数を持たせて、標準の関数の代わりに呼び出すことができます。

source: For example, a script that #Requires AutoHotkey v2 will not run on v2.0-a112.
ja: 例えば、#Requires AutoHotkey v2のスクリプトは、v2.0-a112では実行されません。

source: For example, a setting of 16 requires the tick count to change by 17 or greater.
ja: 例えば、16を設定すると、17以上の刻みの変化が必要となります。

source: For example, a transparent Text control displayed on top of a Picture control would make the text appear to be part of the picture.
ja: 例えば、ピクチャコントロールの上に透明なテキストコントロールを表示すると、テキストがピクチャの一部に見えるようになります。

source: For example, a value of -1 as an Int64 is really 0xFFFFFFFFFFFFFFFF if it is intended to be a UInt64.
ja: 例えば、Int64として-1という値は、UInt64を意図している場合、本当は0xFFFFFFFFFFFFFFFFになります。

source: For example, a value of 101 causes all input generated by SendEvent to be ignored, while a value of 1 only ignores input at the default send level (zero).
ja: 例えば、101を指定するとSendEventで生成されたすべての入力が無視され、1を指定するとデフォルトの送信レベル（0）の入力のみが無視されます。

source: For example, a value of 3 for this parameter provides both an edit field and a "make new folder" button.
ja: 例えば、このパラメータの値を3にすると、編集フィールドと「新しいフォルダを作る」ボタンの両方が表示されます。

source: For example, an Array contains a sequence of items, while a Map associates keys with values.
ja: 例えば、Arrayは項目の列を含み、Mapはキーと値を関連付ける。

source: For example, an instance of Array must always derive from Array.Prototype, either directly or indirectly.
ja: 例えば、Arrayのインスタンスは必ずArray.Prototypeから直接または間接的に派生していなければならない。

source: For example, an item displayed as "a & b" may match a parameter value of a && b or a b.
ja: 例えば、「a & b」と表示される項目は、a && bまたはa bというパラメータ値と一致する場合があります。

source: For example, an object with one property and one method might be constructed like this:
ja: 例えば、1つのプロパティと1つのメソッドを持つオブジェクトは次のように構築される：

source: For example, assigning "A &&& B" would display "A & B" in the tooltip.
ja: 例えば、"A &&& B"と割り当てると、ツールチップに「A & B」と表示される。

source: For example, both $U1 and $U{1} transcribe an uppercase version of the first subpattern.
ja: 例えば、$U1と$U{1}は、どちらも最初のサブパターンの大文字を転写する。

source: For example, by using the following methods in order, Verdana will be given preference over Arial, which in turn is given preference over MS Sans Serif:
ja: 例えば、以下の方法を順番に使用すると、VerdanaはArialよりも優先され、MS Sans Serifよりも優先されます：

source: For example, by using the following methods in order, Verdana will be given preference over Arial, which in turn is given preference over MS sans serif:
ja: 例えば、以下の方法を順番に使用すると、VerdanaはArialよりも優先され、MS sans serifよりも優先されます：

source: For example, consider the two classes below.
ja: 例えば、以下の2つのクラスを考えてみよう。

source: For example, consider this code for maximizing the active window:
ja: 例えば、アクティブウィンドウを最大化するためのコードを考えてみましょう：

source: For example, consider this simple set of instructions:
ja: 例えば、こんな簡単な命令を考えてみましょう：

source: For example, control-right-button would be expressed as ^RButton::.
ja: 例えば、control-right-buttonは、^RButton::と表現されます。

source: For example, http://someorg.org might retrieve the welcome page for that organization.
ja: 例えば、http://someorg.org、その組織のウェルカムページを取得することができるかもしれません。

source: For example, if 2 is specified and ColorID is 0x444444, any color from 0x424242 to 0x464646 will be considered a match.
ja: 例えば、2が指定され、ColorIDが0x444444の場合、0x424242から0x464646までのすべての色が一致するとみなされます。

source: For example, if Discount/100 converts a discount percentage to a fraction, 1 - Discount/100 calculates a fraction representing the remaining amount, and Price * (1 - Discount/100) applies it to produce the net price.
ja: 例えば、Discount/100で割引率を分数に変換した場合、1 - Discount/100で残額を表す分数を計算し、Price * (1 - Discount/100)を適用してネット価格を算出します。

source: For example, if DriveLock("D:") was called three times, DriveUnlock("D:") might need to be called three times to unlock it.
ja: 例えば、DriveLock("D:")が3回呼ばれた場合、DriveUnlock("D:")を3回呼ばないとロック解除できない場合があります。

source: For example, if obj.unk has not been assigned a value, it invokes the __Get meta-function.
ja: 例えば、obj.unkに値が割り当てられていない場合、__Getメタファンクションを呼び出します。

source: For example, if :?:al::airline is a hotstring, typing "practical " would produce "practicairline ".
ja: 例えば、:?:al::airlineがホットストリングである場合、「practical 」と入力すると、「practicairline 」が出力されます。

source: For example, if *2 is specified and the color of a pixel is 0x444444, any color from 0x424242 to 0x464646 will be considered a match.
ja: 例えば、*2が指定され、画素の色が0x44444の場合、0x424242から0x464646までの任意の色が一致するとみなされます。

source: For example, if :o:ar::aristocrat is a hotstring, typing "ar" followed by the spacebar will produce "aristocrat" with no trailing space, which allows you to make the word plural or possessive without having to press Backspace.
ja: 例えば、:o:ar::aristocratがホットストリングである場合、arと入力した後にスペースキーを押すと、末尾にスペースがないaristocratとなり、Backspaceを押すことなく複数形や所有格にすることが可能です。

source: For example, if BlockInput "On" is currently in effect, using BlockInput "Default" will not turn it off.
ja: 例えば、現在BlockInput "On"が有効な場合、BlockInput "Default"を使用しても、これをオフにすることはできません。

source: For example, if MyClass has not yet been initialized, MyClass.MyProp would cause the class to be initialized before the property is retrieved.
ja: 例えば、MyClassがまだ初期化されていない場合、MyClass.MyPropはプロパティが取得される前にクラスを初期化します。

source: For example, if OmitChars is " `t", spaces and tabs will be removed from the beginning and end (but not the middle) of every element.
ja: 例えば、OmitCharsが " `t"の場合、すべての要素の最初と最後（途中は除く）からスペースとタブが取り除かれる。

source: For example, if OmitChars is A_Space A_Tab, spaces and tabs will be removed from the beginning and end (but not the middle) of every retrieved substring.
ja: 例えば、OmitCharsが A_Space A_Tabの場合、検索されたすべての部分文字列の先頭と末尾からスペースとタブが削除されます（中央は削除されない）。

source: For example, if myObj contains a reference to an object, yourObj := myObj creates a new reference to the same object.
ja: 例えば、myObjにオブジェクトへの参照が含まれている場合、yourObj := myObjは同じオブジェクトへの新しい参照を作成します。

source: For example, if Value contains a space followed by a letter, it is not considered to be alpha.
ja: 例えば、Valueにスペースがあり、その後に文字が続く場合は、αとはみなされない。

source: For example, if MatchList is ABC , XYZ, the user must type a space after ABC or before XYZ to cause a match.
ja: 例えば、MatchListが ABC , XYZの場合、ユーザーはABCの後かXYZの前にスペースを入力しなければ、マッチングが発生しません。

source: For example, if InputFile's lines are each a series of tab-delimited fields, those fields can individually retrieved as in this example:
ja: 例えば、InputFileの行がそれぞれタブ区切りのフィールドの列である場合、この例のようにフィールドを個別に取得することができます：

source: For example, if Try uses return 42, the value 42 is returned after the Finally block executes.
ja: 例えば、tryが return 42を使用したときは、finallyブロックが実行された後に値42が返されます。

source: For example, if try uses return 42, the value 42 is returned after the finally block executes.
ja: 例えば、tryが return 42を使用した場合、finallyブロックが実行された後に値42が返されます。

source: For example, if Ctrl is currently down, Click would produce a control-click but Send "{Click}" would produce a normal click.
ja: 例えば、現在Ctrlが押されている場合、Clickはコントロールクリックになりますが、Send "{Click}"は通常のクリックになります。

source: For example, if A_Language contains 0436, the system's default language is Afrikaans (South Africa).
ja: 例えば、A_Languageに0436が格納されているときは、システムのデフォルト言語はアフリカーンス語（南アフリカ）です。

source: For example, if A_Language contains 0436, the system's default language is Afrikaans.
ja: たとえば、A_Languageに0436が含まれていれば、システムのデフォルト言語はアフリカーンス語である。

source: For example, if NotifyNonText is true, pressing Ctrl+A will produce OnKeyDown and OnKeyUp calls for both Ctrl and A, while pressing A on its own will not call OnKeyDown or OnKeyUp unless KeyOpt has been used to enable notifications for that key.
ja: 例えば、NotifyNonTextがtrueの場合、Ctrl+Aを押すと、Ctrlと Aの両方でOnKeyDownと OnKeyUpが呼び出されますが、KeyOptでそのキーに対する通知を有効にしていなければ、A単独で押してもOnKeyDownやOnKeyUpは呼ばれません。

source: For example, if WinLIRC recognizes a button named "VolUp" on your remote control, create a label named VolUp and beneath it use the function SoundSetVolume "+5" to increase the soundcard's volume by 5 %.
ja: 例えば、WinLIRCがリモコンの「VolUp」というボタンを認識した場合、VolUpというラベルを作成し、その下にサウンドカードの音量を5%上げる関数SoundSetVolume "+5"を使用します。

source: For example, if a ListBox/ComboBox contains the item "UNIX Text", specifying the word "unix" (lowercase) would be enough to select it.
ja: 例えば、ListBox/ComboBoxに「UNIX Text」という項目がある場合、「unix」という単語（小文字）を指定すれば選択されます。

source: For example, if a ListBox/ComboBox contains the item "UNIX Text", specifying the word unix (lowercase) would be enough to select it.
ja: 例えば、ListBox/ComboBoxに「UNIX Text」という項目がある場合、「unix」という単語（小文字）を指定すれば選択されます。

source: For example, if a hotkey has a max of 1 and it is pressed again while its subroutine is already running, the press will be ignored.
ja: 例えば、あるホットキーの最大値が1で、そのサブルーチンがすでに実行されているときに再度押された場合、その押下は無視されます。

source: For example, if a monitor function does not finish quickly, the response to the message might take longer than the system expects, which might cause side-effects.
ja: 例えば、モニター関数が早く終わらない場合、メッセージに対する応答がシステムの想定よりも長くなり、副作用が発生する可能性があります。

source: For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program.
ja: 例えば、ある特許ライセンスが、あなたを通じて直接あるいは間接的に複製を受 け取るすべての人々による、ロイヤリティのかからない『プログラム』の再頒布を許 可しないのであれば、あなたが特許ライセンスと本許諾書の両方を満たす唯一の 方法は、『プログラム』の頒布を完全に控えることでしょう。

source: For example, if a script includes the line #Include <MyLib>, the program searches for a file named "MyLib.ahk" in the local library.
ja: 例えば、スクリプトに#Include <MyLib>という行が含まれていると、プログラムはローカル・ ライブラリから「MyLib.ahk」という名前のファイルを探す。

source: For example, if a the control contains the tab "UNIX Text", specifying the word unix (lowercase) would be enough to use it.
ja: 例えば、あるコントロールに "UNIX Text" というタブがある場合、unix（小文字）という単語を指定すれば、それを使用することができます。

source: For example, if it renames files via FileMove or other means, each such file might be found twice:
ja: 例えば、FileMoveなどでファイル名を変更した場合、そのようなファイルが2回見つかる可能性があります：

source: For example, if it renames files via FileMove or other means, each such file might be found twice: once as its old name and again as its new name.
ja: 例えば、FileMoveなどでファイル名を変更した場合、そのようなファイルが2回見つかる可能性があります：旧名称ならば、新名称とします。

source: For example, if it was run via shortcut -- such as on the Start Menu -- its initial working directory is determined by the "Start in" field within the shortcut's properties.
ja: 例えば、スタートメニューのようなショートカットから実行した場合、最初の作業ディレクトリはショートカットのプロパティにある「Start in」フィールドによって決定されます。

source: For example, if the actual difference between two timestamps is 1.999 days, it will be reported as 1 day.
ja: 例えば、2つのタイムスタンプの実際の差が1.999日であれば、1日として報告されることになります。

source: For example, if the control contains the item "UNIX Text", specifying the word unix (lowercase) would be enough to select it.
ja: 例えば、コントロールに「UNIXテキスト」という項目がある場合、unix（小文字）という単語を指定すれば、それだけで選択できます。

source: For example, if the control contains the tab "UNIX Text", specifying the word unix (lowercase) would be enough to use it.
ja: 例えば、あるコントロールに「UNIX Text」というタブがある場合、unix（小文字）という単語を指定すれば、それを使用することができます。

source: For example, if the control was created with the text Shell.Explorer, this is a WebBrowser object.
ja: 例えば、Shell.Explorerというテキストでコントロールが作成された場合、これはWebBrowserオブジェクトであることを示しています。

source: For example, if the letter B is specified for this parameter, the shortcut key will be Ctrl+Alt+B.
ja: 例えば、このパラメータに文字Bを指定した場合、ショートカットキーはCtrl+Alt+Bとなります。

source: For example, if the remapping a::b is in effect, pressing Ctrl+Alt+A would trigger the ^!b hotkey only if ^!b is not a hook hotkey.
ja: 例えば、a::bのリマッピングが有効な場合、Ctrl+Alt+Aを押すと、^!bがフックホットキーでない場合のみ^!bホットキーがトリガーされます。

source: For example, if the return value is assigned to a variable named ClassNNs and two controls are present, ClassNNs[1] contains the name of the first control, ClassNNs[2] contains the name of the second control, and ClassNNs.Length returns the number 2.
ja: 例えば、戻り値がClassNNsという変数に代入され、2つのコントロールが存在する場合、ClassNNs[1]には1つ目のコントロールの名前、ClassNNs[2]には2つ目のコントロールの名前が格納され、ClassNNs.Lengthは、数値2を返す。

source: For example, if the return value is assigned to a variable named Controls and two controls are present, Controls[1] contains the ID of the first control, Controls[2] contains the ID of the second control, and Controls.Length returns the number 2.
ja: 例えば、戻り値がControlsという変数に代入され、2つのコントロールが存在する場合、Controls[1]には1つ目のコントロールのIDが、Controls[2]には2つ目のコントロールのIDが格納され、Controls.Lengthは、数値2を返す。

source: For example, if the return value is assigned to a variable named Controls and two controls are present, Controls[1] contains the name of the first control, Controls[2] contains the name of the second control, and Controls.Length returns the number 2.
ja: 例えば、戻り値がControlsという変数に代入され、2つのコントロールが存在する場合、Controls[1]には1つ目のコントロールの名前、Controls[2]には2つ目のコントロールの名前が格納され、Controls.Lengthは、数値2を返す。

source: For example, if the return value is assigned to a variable named HWNDs and two controls are present, HWNDs[1] contains the ID of the first control, HWNDs[2] contains the ID of the second control, and HWNDs.Length returns the number 2.
ja: 例えば、戻り値がHWNDsという変数に代入され、2つのコントロールが存在する場合、HWNDs[1]には1つ目のコントロールのIDが、HWNDs[2]には2つ目のコントロールのIDが格納され、HWNDs.Lengthは、数値2を返します。

source: For example, if the return value is assigned to a variable named HWNDs and two matching windows are discovered, HWNDs[1] contains the ID of the first window, HWNDs[2] contains the ID of the second window, and HWNDs.Length returns the number 2.
ja: 例えば、戻り値がHWNDsという変数に代入され、2つのマッチするウィンドウが見つかったときは、HWNDs[1]は最初のウィンドウのIDを格納し、HWNDs[2]は2番目のウィンドウのIDを格納します。HWNDs.Lengthは数値2を返します。

source: For example, if the return value is assigned to a variable named List and two matching windows are discovered, List[1] contains the ID of the first window, List[2] contains the ID of the second window, and List.Length returns the number 2.
ja: 例えば、戻り値がListという変数に代入され、一致する2つのウィンドウが発見された場合、List[1]には最初のウィンドウのIDが、List[2]には2番目のウィンドウのIDが格納され、List.Lengthは数値2を返す。

source: For example, if the script calls KeyHistory 50, up to 25 keystrokes and mouse clicks will be displayed.
ja: 例えば、スクリプトがKeyHistory 50を呼び出すと、最大25個のキーストロークとマウスクリックが表示されます。

source: For example, if the script is displaying a message box and the user clicks a button in a GUI window, the WM_LBUTTONDOWN message is sent directly to the button without calling the monitor function.
ja: 例えば、スクリプトがメッセージボックスを表示しているときに、ユーザーがGUIウィンドウのボタンをクリックした場合、WM_LBUTTONDOWNメッセージはモニター関数を呼び出すことなく、直接ボタンに送信されます。

source: For example, if the target window is running at a higher integrity level than the script (i.e. it is running as admin while the script is not), messages may be blocked.
ja: 例えば、ターゲットウィンドウがスクリプトよりも高い整合性レベルで実行されている場合（スクリプトは管理者として実行されているが、スクリプトはそうではない）、メッセージがブロックされることがあります。

source: For example, if the user presses a hotkey while the current thread is uninterruptible, the hotkey is buffered indefinitely until the current thread finishes or becomes interruptible, at which time the hotkey is launched as a new thread.
ja: たとえば、現在のスレッドが割り込み不可能な状態でユーザーがホットキーを押すと、現在のスレッドが終了するか割り込み可能になるまで、ホットキーは無期限にバッファリングされ、その時点でホットキーは新しいスレッドとして起動されます。

source: For example, if there are three tabs ["Red", "Green", "Blue"] and the second tab is removed by means of MyTab.Delete(2), the sub-controls originally associated with Green will now be associated with Blue.
ja: 例えば、3つのタブ["Red", "Green", "Blue"]があり、MyTab.Delete(2)で2番目のタブを削除すると、もともとGreenに関連していたサブコントロールは、Blueに関連付けられます。

source: For example, if there are three tabs ["Red","Green","Blue"] and the second tab is removed by means of MyTab.Delete(2), the sub-controls originally associated with Green will now be associated with Blue.
ja: 例えば、3つのタブ["Red", "Green", "Blue"]があり、MyTab.Delete(2)で2番目のタブを削除すると、もともとGreenに関連していたサブコントロールは、Blueに関連付けられます。

source: For example, if three pairs of coordinates are specified, the new display area will be a triangle in most cases.
ja: 例えば、3組の座標が指定された場合、ほとんどの場合、新しい表示領域は三角形になる。

source: For example, if you accidentally press a hotkey twice, having this setting ON would cause that hotkey's subroutine to automatically run a second time if its first thread takes less than 1 second to finish (this type of buffer expires after 1 second, by design).
ja: 例えば、誤ってホットキーを2回押してしまった場合、この設定をONにすると、そのホットキーのサブルーチンは、最初のスレッドが1秒未満で終了した場合、自動的に2回目を実行します（このタイプのバッファは、設計上1秒後に終了します）。

source: For example, if you are running AutoHotkey32.exe, look for AutoHotkey32.ahk.
ja: 例えば、AutoHotkey32.exeを実行している場合、AutoHotkey32.ahkを探します。

source: For example, if you configure a mystery key to send Ctrl+F1, you can then indirectly make that key as a hotkey by using ^F1:: in a script.
ja: 例えば、Ctrl+F1を送信するようにミステリーキーを設定した場合、スクリプトで^F1::を使うことで、間接的にそのキーをホットキーとして使用することができます。

source: For example, if you configure the fourth button to send Ctrl+F1, you can then indirectly configure that button as a hotkey by using ^F1:: in a script.
ja: 例えば、第4ボタンでCtrl+F1を送信するように設定すると、スクリプトで^F1::を使って間接的にそのボタンをホットキーとして設定することができます。

source: For example, if you distribute copies of such a program, whether gratis or for a fee, you must give the recipients all the rights that you have.
ja: 例えば、あなたがそのようなプログラムの複製物を頒布する場合、無償であろうと有償であろうと、あなたはあなたが有するすべての権利を受領者に与えなければなりません。

source: For example, if you frequently work with many instances of a graphics program or text editor, you can use GroupActivate on a hotkey to visit each instance of that program, one at a time, without having to use alt-tab or task bar buttons to locate them.
ja: 例えば、グラフィックプログラムやテキストエディタの多くのインスタンスを頻繁に使用する場合、ホットキーのGroupActivateを使用すると、alt-tabやタスクバーボタンを使用してそれらのインスタンスを探すことなく、一度にそれぞれのプログラムのインスタンスを訪問できます。

source: For example, if you have "by the way" selected in a word processor, pressing Win+H will prompt you for its abbreviation (e.g. btw), add the new hotstring to the script and activate it.
ja: 例えば、ワープロで「by the way」を選択している場合、Win+Hを押すと、その省略形（例：btw）の入力を促し、新しいホットストリングをスクリプトに追加して有効にします。

source: For example, if you know there can be only one match near the beginning of a large string, specify a limit of 1.
ja: 例えば、大きな文字列の先頭付近に1つしかマッチしないことが分かっている場合、制限値1を指定します。

source: For example, if you rarely use the right Alt, make it perform the action you do most often:
ja: 例えば、右のAltをほとんど使わないのであれば、一番よく使う動作をさせる：

source: For example, if you rename AutoHotkey.exe to MyScript.exe, it will attempt to load MyScript.ahk.
ja: たとえば、AutoHotkey.exeの名前をMyScript.exeに変更すると、MyScript.ahkをロードしようとします。

source: For example, if you wish Win+E (the shortcut key that launches Windows Explorer) to perform some other action, use this:
ja: 例えば、Win+E（ウィンドウズ・エクスプローラーを起動するショートカットキー）に他の動作をさせたい場合は、こうします：

source: For example, in a 32-bit script, HKLM\SOFTWARE\AutoHotkey is redirected to HKLM\SOFTWARE\Wow6432Node\AutoHotkey.
ja: 例えば、32ビットスクリプトの場合、HKLM\SOFTWARE\AutoHotkeyは HKLM\SOFTWARE\Wow6432Node\AutoHotkeyへリダイレクトされる。

source: For example, in both of the below hotkeys, the active window will receive all right-clicks even though only one of the definitions contains a tilde:
ja: 例えば、次の2つのホットキーでは、定義のうち1つだけがチルダを含んでいても、アクティブウィンドウはすべての右クリックを受け付けます：

source: For example, in some locales it might appear as 4:55 PM Saturday, November 27, 2004
ja: 例えば、ある地域では2004年11月27日（土）午後4時55分と表示されるでしょう。

source: For example, in the following expression, only the leftmost comparison occurs whenever ColorName is blank.
ja: 例えば、以下の式では、ColorNameが空白の場合は、左端の比較のみが行われます。

source: For example, in the following expression, the variable Done is assigned 1 if A_Index is greater than 5 or the value of FoundIt in all other cases:
ja: 例えば、以下の式ではA_Indexが5より大きいときは変数Doneに1が代入され、それ以外のときはFoundItの値が代入されます：

source: For example, in the script below, holding Menu will show the tooltip and will not trigger a context menu:
ja: 例えば、以下のスクリプトでは、Menuを押すと、ツールチップが表示され、コンテキストメニューは起動しません：

source: For example, in the unlikely event that there is a control whose text or ClassNN has the format "Xnnn Ynnn", it would be acted upon by Mode 2.
ja: 例えば、万が一、テキストやClassNNが「Xnnn Ynnn」の形式を持つコントロールがあった場合、モード2が作用することになる。

source: For example, in the unlikely event that there is a control whose text or ClassNN has the format "Xnnn Ynnn", it would be acted upon by mode 2.
ja: 例えば、万が一、テキストやClassNNが「Xnnn Ynnn」の形式を持つコントロールがあった場合、モード2が作用することになる。

source: For example, instead of the window title "Untitled - Notepad", we can use the window's class, which in this case happens to be "Notepad" regardless of the system language:
ja: 例えば、ウィンドウのタイトル「Untitled - Notepad」の代わりに、ウィンドウのクラス（この場合、システムの言語に関係なく「Notepad」である）を使用することができます：

source: For example, it allows your keystrokes to be invisible in the active window (such as a game).
ja: 例えば、アクティブなウィンドウ（ゲームなど）において、キー操作を見えなくすることができます。
